# Проект FitLife - MVP версия 1.0

# 30 мл на кг. - стандартная рекомендация для поддержания водного баланса
WATER_PER_KG = 30

# соотношение миллилитров в 1 литре
ML_TO_L_RATIO = 1000


print("Приветствую! Это фитнес-бот FitLife.")

# 1. Знакомство
# Спрашиваем у пользователя имя
user_name = input("Как тебя зовут? ")

# Спрашиваем возраст
user_age = input("Введите возраст (полных лет): ")
user_age = int(user_age)


# 2. Сбор данных
# Запрашиваем вес (в кг.)
user_weight = input("Введите вес в кг. (например: 80.5): ")
user_weight = float(user_weight)
# Запрашиваем рост (в метрах)
user_height = input("Введите рост в метрах. (например: 183.5): ")
user_height = float(user_height)


# 3. Расчеты
# Рассчитываем Индекс массы тела (ИМТ) (вес / (рост в квадрате))
bmi = user_weight / (user_height ** 2)

# Рассчитываем норму воды в миллилитрах (вес * кол-во воды в мл. на 1 кг.)
water_needed = user_weight * WATER_PER_KG
# Переводим норму воды в литры
water_needed_l = water_needed / ML_TO_L_RATIO


# 4. Вывод красивого результата
# Приветствие
print(f"Привествую: {user_name}!")

# Выводим возраст, ИМТ (округленный до 1 десятичного знака) и норму воды.
print(f"Отчет для пользователя: {user_name} ({user_age} л.)")
print(f"Твой Индекс Массы Тела: {round(bmi, 1)}")
print(f"Рекомендуемая норма воды: {round(water_needed_l, 1)} л. в день")

print("Расчет окончен. Будьте здоровы!")
